<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.51 [de] (Win95; I) [Netscape]">
   <meta name="Author" content="Christoph Müller">
   <title>Hilfe zur Bedienung des Kochbuchs</title>
</head>
<body background="indtextb.jpg">
<center>
<h1>
<a href="Index.htm" TARGET="_top"><img SRC="Logo.gif" ALT="Zur Hilfe-Startseite" BORDER=0 height=32 width=19></a>&nbsp;Kochbuch</h1></center>
<center>
<h2>Bedienung</h2></center>
<h3>Allgemeines</h3>
Als Server-Anwendung ist das Kochbuch von den F&auml;higkeiten der Browser
abh&auml;ngig. &Auml;hnlichkeiten mit Windows-Anwendungen sind gew&uuml;nscht,
jedoch nur begrenzt m&ouml;glich. Insbesondere tritt die Bedeutung der
Verarbeitung in mehreren Fenstern in den Hintergrund. Stattdessen ist eine
Verschachtelung von Anwendungsfunktionen mit R&uuml;ckkehr-Logik wichtig.
Diese Handhabung ist u.U. den Kennern von Gro&szlig;rechner-Anwendungen
vertraut.
<p>Hinweis: Die Benutzung jeglicher Back-Funktionen der Broswer ist nicht
unterst&uuml;tzt. Stattdessen m&uuml;ssen die Funktionen innerhalb der
Anwendung f&uuml;r die Navigation benutzt werden, insbesondere z.B. der
Button "Zur&uuml;ck".
<p><b>Beispiel:</b>
<br>Der Aufruf von einem Untermen&uuml; f&uuml;hrt zur Funktion Kochbuch-Recherche.
Mit dem Button "Zur&uuml;ck" kommt man genau an die Stelle zur&uuml;ck,
von der man die Funktion gerufen hat.
<br>&nbsp;
<h3>Toolbar</h3>
Die Toolbar dient der schnellen Navigation zu h&auml;ufig ben&ouml;tigten
Funktionen. Sie beendet den vorherigen Arbeitsschritt ab und startet die
gew&uuml;nschte Funktion neu. Eine R&uuml;ckkehr zur beendeten Funktion
ist nicht m&ouml;glich.
<br>&nbsp;
<br>&nbsp;
<table COLS=2 WIDTH="100%" >
<tr>
	<td valign=top WIDTH="20">[icon menu]&nbsp;</td>
	<td>Verzweigt zum Hauptmen&uuml;</td>
</tr>
<tr>
	<td valign=top>[icon enquiry]&nbsp;</td>
	<td>Startet die Kochbuch-Recherche</td>
</tr>
<tr>
	<td valign=top>[icon close]&nbsp;</td>
	<td>Schlie&szlig;t die Abnwendung nach Abmeldung beim Server. Diese Funktion
	ist dem Schlie&szlig;en des Fensters durch Windows-Funktionen zu bevorzugen,
	da insbesondere im Falle von deaktiviertem JavaScript der Server nicht
	dar&uuml;ber informiert werden kann, dass die Anwendung nicht mehr ben&ouml;tigt
	wird.</td>	
</tr>
</table>

<p>
<hr WIDTH="100%">
<h3><a NAME="Menü"></a>Men&uuml;</h3>
<img SRC="menu.jpg" height=235 width=409>
<br>&nbsp;
<p>Das Men&uuml; ist hierarchisch aufgebaut und umfasst viele Stufen. Mittels
Button "Zur&uuml;ck" gelangt man wieder eine Hierarchie-Stufe aufw&auml;rts.
Die Verzweigung erfolgt &uuml;ber Mauszeiger und Einfachclick.
<br>&nbsp;
<p>
<hr WIDTH="100%">
<h3><a NAME="Search"></a>Recherche/Suche im Kochbuch</h3>
Dient dem Auffinden von Rezepten nach einem oder mehreren Suchkriterien.
Einschr&auml;nkende Angaben eingeben und Button "Auflisten" dr&uuml;cken.
<p><b>Hinweise:</b>
<ul>
<li>Die Kombination der Begriffseingabe ist zul&auml;ssig. Sie dienen der Beschr&auml;nkung der Abfrage bzw. der Genauigkeit des Ergebnisses.</li>
<li>Alle Kriterien sind Und-Bedingungen, das heisst, je mehr angegeben wird,
desto geringer (und damit genauer) ist die Anzahl betroffener Rezepte.</li>
<li>Textliche Angaben werden grunds&auml;tzlich generisch interpertiert, das
heisst z.B. der Begriff <i>Karotte </i>im Feld <i>Rezept-Bezeichnung </i>findet
<i>Karottensalat</i> und <i>Karottenbrei</i>. Wird der Brgriff <i>Karotte</i>im Feld <i>Zutaten </i>eingegeben, werden alle Rezepte angezeigt die in der Zutatenliste das Wort <i>Karotte </i>haben.</li>
</ul>
<hr WIDTH="100%">
<h3><a NAME="showlist"></a>Recherche-Ergebnis</h3>
<p>Hier werden die gesuchten Rezepte bis zu einer definierten Maximalmenge
angezeigt und zur weiteren Bearbeitung angeboten. Klick man z.B. auf eines
der gefundenen Rezepte, wird dieses detailliert angezeigt.
<p><img SRC="showlist.jpg" height=270 width=404>
<br>&nbsp;
<br>&nbsp;
<p>
<hr WIDTH="100%">
<h3><a NAME="Login"></a><font color="#000000">Login f&uuml;r mehr Funktionalit&auml;t</font></h3>
<img SRC="login.jpg" height=261 width=567>
<p>Ohne Anmeldung stehen elementare Funktionen ohne &Auml;nderungsrechte
zur Verf&uuml;gung. F&uuml;r mehr Macht ist eine Anmeldung erforderlich.
In diesem Beispiel sind folgende Erweiterungen der Befugnisse illustriert:
<br>&nbsp;
<table WIDTH="100%" >
<tr>
	<th ALIGN=LEFT>Standard:</th>
	<td>Lesen/Modifizieren/Neueingabe/L&ouml;schen von <a href="#newrec">Rezepten</a></td>
</tr>
<tr>
	<th ALIGN=LEFT>Org:</th>
	<td>Lesen/Modifizieren/Neueingabe/L&ouml;schen von <a href="#newcat">Rezept-Typen</a><b> und</b> Rezepten.&nbsp;</td>
</tr>
<tr>
	<th ALIGN=LEFT>Admin:</th>
	<td>Lesen/Modifizieren/Neueingabe/L&ouml;schen von <a href="#newgrp">Benutzer/Gruppen</a>, Rezepten <b>und </b>Rezept-Typen</td>
</tr>
</table>
<p>
<hr WIDTH="100%">
<h3><a NAME="newrec"></a>Anlegen von Rezepten</h3>
Vor dem Anlegen neuer Rezepte ist es sinnvoll, mittels Recherche zu &uuml;berpr&uuml;fen, ob das Rezept schon vorhanden ist. Dies vermeidet Duplikate. Das Anlegen erfolgt durch Angaben in den Eingabefeldern und Abspeichern mittels Button "Ok". Durch Bet&auml;tigung des Buttons "Abbrechen" wird die Anlage verworfen.
<p><img SRC="newrec.jpg" width=573 height=477>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<table WIDTH="100%" >
<tr>
	<th ALIGN=LEFT>Rezept-Titel</th>
	<td valign=top>Eingabe eines Rezepttitels z.B. H&uuml;nersuppe&nbsp;</td></tr>
<tr>
	<th ALIGN=LEFT>Rezept-Type</th>
	<td valign=top>Eingabe des Rezepttypes z.B. Suppe</td></tr>
<tr>
	<th ALIGN=LEFT>Diabetiker-<br>Empfehlung</th>
	<td valign=top>Wenn das Rezept f&uuml;r Diabetiker empfehlensweret ist</td></tr>
<tr>
	<th ALIGN=LEFT>Zutaten</th>
	<td valign=top>Zutaten des Rezeptes</td></tr>
<tr>
	<th ALIGN=LEFT>Vorbereitung</th>
	<td valign=top>Eingabe der Vorbereitung wie es gemacht wird</td></tr>
<tr>
	<th ALIGN=LEFT>Quelle</th>
	<td valign=top>Eingabe der Quelle aus der das Rezept stammt</td></tr>
<tr>
	<th ALIGN=LEFT>Original Datum</th>
	<td valign=top>Datum des Ersterscheinens</td></tr>
</table>
<p>
<hr WIDTH="100%">
<h3><a NAME="charec"></a>&Auml;ndern von Rezepten</h3>
Es ist möglich bestehende Einträge bzw. Rezepte zu ändern. Das Ändern erfolgt nach dem Auffinden des Rezeptes das zu ändern ist und dem einfachklicken des Buttons "Bearbeiten". Das Speichern erfolgt mittels Button "Ok". Durch Bet&auml;tigung des Buttons "Abbrechen" wird das Ändern verworfen.
<p><img SRC="charec.jpg" width=596 height=276>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>
<hr WIDTH="100%">
<h3><a NAME="delrec"></a>L&ouml;schen von Rezepten</h3>
Es ist auch möglich bestehende Einträge bzw. Rezepte zu löschen. Das Löschen erfolgt nach dem Auffinden des Rezeptes das zu löschen ist und dem einfachklicken des Buttons "Löschen". Die Löschbestätigung erfolgt mittels Button "Ok". Durch Bet&auml;tigung des Buttons "Abbrechen" wird das Löschen verworfen.
<p><img SRC="delrec.jpg" width=541 height=279>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>
<hr WIDTH="100%">
<h3><a NAME="newcat"></a>Anlegen von Rezept-Typen</h3>
Schl&uuml;ssel dienen der einheitlichen Zuordnung von Zugeh&ouml;rigkeiten
z.B. der Rezept-Typen. In dieser Verwaltung wird festgelegt, was und in
welcher Reihenfolge bei der Rezeptverwaltung in der entsprechenden Selectbox
angeboten wird.
<p>Rezept-Typen k&ouml;nnen z.B. Suppe, Vorspeise, Kochrezept, Backrezept
oder Nachtisch sein.
<p><img SRC="newcat.jpg" width=600 height=599>
<br>&nbsp;
<br>&nbsp;
<table BORDER=0 WIDTH="100%" >
<tr>
	<th  valign=top>Beschreibung</th>
	<td>gibt den Namen des Rezepttypes an. Dieses Feld muss eingegeben werden.</td></tr>
<tr>
	<th valign=top>Pos(Position)</th>
	<td valign=top>erm&ouml;glicht eine beliebige Sortierung der Rezeptgruppen. Wird Sie
	leer gelassen, werden die Rezeptgruppen alphabetisch sortiert.</td>
</tr>
</table>
<p>Best&auml;tigen Sie die Eingabe mit dem Button "OK".
<br>
<hr wiDTH="100%">
<h3><a NAME="admin"></a>Anlegen von Benutzer und Gruppen</h3>
<img SRC="admin.jpg" width=637 height=472 alt="User ID und User Group Anlegen">
<p>Der Men&uuml;punkt <i>Administration</i> und darunter <i>Benutzer-Verwaltung</i>
erm&ouml;glichen das Anlegen von Benutzern (siehe oben, Feld <i>User ID</i>) und Benutzergruppen (siehe oben, Feld <I>User Group</I>). Jede Gruppe
ist mit besonderen Rechten versehen sodass die dazugeh&ouml;rigen Benutzer
nur das tun d&uuml;rfen was f&uuml;r diese Gruppe definiert ist.
<p>Best&auml;tigen Sie die Eingabe mit dem Button "OK".
<p>
<hr WIDTH="100%">
<center>&nbsp;&copy; <b><font face="Arial,Helvetica"><font color="#000066">M&Uuml;LLER
UND STEIN</font></font></b> <i><font face="Times New Roman,Times"><font color="#666666">software</font></font></i>&nbsp;&nbsp;&nbsp;
[ <a href="Index.htm" TARGET="_top">zur Hilfe-Startseite ]</a></center>
</body>
</html>
